nextmwa/haro-firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"

# Custom partition table: adds the "model" SPIFFS partition ESP-SR packs its
# WakeNet/AFE model data into (components/wake_word, Task 5).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-S3R8 module on this board has 16MB flash (see design spec); the
# custom partition table above (nvs + 3M factory app + 5900K model) needs
# more than the 2/4MB ESP-IDF default.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP-SR (components/wake_word, Task 5): select the "Hi,ESP" WakeNet9 model
# so esp_srmodel_filter(..., ESP_WN_PREFIX, "hiesp") actually finds a model
# packed into the "model" partition at build time. All WakeNet models are
# CONFIG_SR_WN_* = n by default (see managed_components/espressif__esp-sr's
# Kconfig.projbuild) -- without this, the model partition would be built
# empty and wakenet_model_name would resolve to NULL at runtime.
CONFIG_SR_WN_WN9_HIESP=y

# network_provisioning (components/wifi_provisioning, Task 9): protocomm's
# security version 1 (X25519 handshake + proof-of-possession) is disabled by
# default -- only version 2 (SRP6a) ships enabled out of the box (see
# esp-idf/components/protocomm/Kconfig). Task 9 uses NETWORK_PROV_SECURITY_1
# per the brief, since it only needs a single shared proof-of-possession
# string (matching the Pi's hotspot_password model) rather than SRP6a's
# per-device salt/verifier provisioning story.
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
